{
    "privacy.title": "Política de Privacidade",
    "privacy.header": "Política de Privacidade do ReKindle",
    "privacy.last_updated": "Última atualização: Fevereiro de 2026",
    "privacy.intro": "O ReKindle é uma aplicação web desenhada para fornecer um painel para dispositivos E-ink. Priorizamos a sua privacidade e transparência.",
    "privacy.section.1.title": "1. Arquitetura de Dados",
    "privacy.section.1.body": "<p>O ReKindle opera em dois modos:</p><ul><li><strong>Modo Visitante:</strong> Todos os dados são armazenados localmente no Armazenamento Local (Local Storage) do seu navegador. Nada é enviado para os nossos servidores. Se limpar o cache do navegador, esses dados serão perdidos.</li><li><strong>Modo Login:</strong> Os dados das aplicações suportadas são sincronizados de forma segura no Google Firebase (Firestore e Realtime Database) sob o seu ID de Usuário único. Isso permite aceder aos seus dados em múltiplos dispositivos.</li></ul>",
    "privacy.section.2.title": "2. Dados do Usuário Google (Gmail, Tarefas, Calendário, Contatos)",
    "privacy.section.2.body": "<p>O ReKindle oferece integração com os serviços do Google para exibir os seus dados pessoais no seu dispositivo. Esta funcionalidade é opcional.</p><ul><li><strong>Gmail (Escopo Restrito):</strong> Se ativado, o ReKindle acede às suas mensagens do Gmail para permitir ler, compor, arquivar, excluir e enviar e-mails diretamente do painel. Isso utiliza escopos restritos para fornecer funcionalidade completa de gestão de correio.</li><li><strong>Acesso:</strong> A aplicação solicita acesso aos seus dados do Google apenas depois de você clicar explicitamente em \"Login\" (na aplicação específica ou configurações) e conceder permissão através do protocolo seguro OAuth 2.0 do Google.</li><li><strong>Uso:</strong> Esses dados são obtidos diretamente dos servidores do Google para o navegador do seu dispositivo. São utilizados apenas para visualização e edição dentro do painel do ReKindle.</li><li><strong>Armazenamento:</strong> Os seus e-mails do Gmail, tarefas, eventos de calendário e contatos <strong>não</strong> são armazenados nos nossos servidores Firebase. Tokens de acesso temporário são guardados no Armazenamento Local do seu navegador para manter a sua sessão.</li><li><strong>Retenção e Exclusão:</strong> Seguimos uma política estrita de minimização de dados. Como os Dados do Usuário Google não são armazenados nos nossos servidores persistentes, não há retenção a longo prazo. Os dados são armazenados em cache localmente no seu navegador durante a sua sessão e são <strong>excluídos imediatamente</strong> ao sair ou limpar o cache do navegador. Pode revogar o acesso do ReKindle a qualquer momento através das configurações de segurança da sua conta Google.</li><li><strong>Partilha:</strong> Não partilhamos os seus dados de usuário do Google com terceiros.</li></ul><p><em>O uso e a transferência para qualquer outra aplicação de informações recebidas das APIs do Google pelo ReKindle aderem à <a href=\"https://developers.google.com/terms/api-services-user-data-policy\" target=\"_blank\" style=\"color:black;\">Política de Dados do Usuário dos Serviços de API do Google</a>, incluindo os requisitos de Uso Limitado.</em></p>",
    "privacy.section.3.title": "3. Mecanismos de Proteção de Dados",
    "privacy.section.3.body": "<p>Empregamos medidas de segurança padrão da indústria para garantir a confidencialidade e integridade dos seus dados sensíveis.</p><ul><li><strong>Criptografia em Trânsito:</strong> Todos os dados transmitidos entre o seu dispositivo, os nossos servidores e serviços de terceiros (incluindo APIs do Google) são criptografados usando <strong>Transport Layer Security (TLS/SSL)</strong>.</li><li><strong>Criptografia em Repouso:</strong> Quaisquer dados sincronizados com a nossa base de dados (conforme detalhado na Seção 4) são hospedados no Google Firebase (Firestore e Realtime Database), que criptografa dados em repouso usando <strong>Advanced Encryption Standard de 256 bits (AES-256)</strong>.</li><li><strong>Acesso Seguro:</strong> O acesso aos dados pessoais é restrito ao usuário autenticado. Utilizamos tokens seguros (OAuth 2.0) para gerir a autorização sem armazenar a sua senha real do Google.</li></ul>",
    "privacy.section.4.title": "4. Sincronização de Dados na Nuvem (Firebase)",
    "privacy.section.4.body": "<p>Se criar uma conta no ReKindle, os seguintes dados da aplicação são armazenados na nossa base de dados (Google Firebase) para permitir a sincronização entre dispositivos:</p><ul><li><strong>Tarefas e Quick ToDo:</strong> Itens de tarefas na app principal ou gerados via escrita manual.</li><li><strong>Calendário (Nativo):</strong> Eventos adicionados ao calendário nativo se o Google Calendar não estiver ativado.</li><li><strong>Contatos (Nativo):</strong> Contatos adicionados manualmente à agenda nativa se o Google Contacts não estiver ativado.</li><li><strong>Notas:</strong> O conteúdo de texto e carimbos de data/hora das suas notas.</li><li><strong>Leitor:</strong> O índice da sua biblioteca e o progresso de leitura (posição CFI) dos seus livros. Os arquivos dos livros são guardados localmente no cache do navegador (IndexedDB) para economizar largura de banda, mas os metadados são sincronizados.</li><li><strong>Configurações:</strong> Preferências gerais, seleção de papel de parede, integrações e as suas chaves de API de IA personalizadas (Pro).</li><li><strong>Relógio:</strong> Cidades guardadas e localização inicial.</li><li><strong>Palavras Cruzadas:</strong> Estado atual do puzzle e progresso da grelha.</li><li><strong>Sudoku:</strong> Estado atual e marcas de lápis.</li><li><strong>Nonogramas (Picross):</strong> Progresso e estados resolvidos.</li><li><strong>Campo Minado:</strong> Estado atual do jogo e temporizador.</li><li><strong>Nerdle:</strong> Estado diário e palpites.</li><li><strong>Xadrez e Damas:</strong> Estatísticas de vitórias/derrotas.</li><li><strong>Placares:</strong> Pontuações altas para <strong>Blocos (Tetris)</strong>, <strong>Cobra</strong>, <strong>Trivia</strong>, <strong>Torre de Hanói</strong>, <strong>Luzes Fora</strong>, <strong>Mario</strong>, <strong>Dino</strong>, <strong>Pet</strong> e <strong>Block Blast</strong> são armazenadas publicamente vinculadas ao seu nome de usuário.</li><li><strong>Leitor Interativo:</strong> Biblioteca de aventuras de texto e progresso.</li><li><strong>Acordes:</strong> Músicas e cifras guardadas.</li><li><strong>Trivia:</strong> Histórico pessoal e estatísticas.</li><li><strong>Registro de Leitura:</strong> Rastreamento diário de duração.</li><li><strong>Hábitos:</strong> Os seus hábitos e histórico de conclusão.</li><li><strong>Ações:</strong> Lista de símbolos que está a seguir.</li><li><strong>Livro de Receitas:</strong> Receitas guardadas.</li><li><strong>Leitor RSS:</strong> URLs dos feeds inscritos.</li><li><strong>Reddit:</strong> Lista de subreddits guardados.</li><li><strong>Cartões (Flashcards):</strong> Baralhos, cartões e intervalos de estudo.</li><li><strong>Contagem Regressiva:</strong> Temporizadores de eventos guardados.</li><li><strong>Soletando (Spellbound):</strong> Palavras encontradas diariamente.</li><li><strong>Palavras (Scrabble):</strong> Estado de jogos multijogador e histórico.</li><li><strong>KindleChat:</strong> Mensagens enviadas em salas de chat.</li><li><strong>Freewrite:</strong> Sessões de escrita ativa e documentos.</li><li><strong>Mapa Mental:</strong> Mapas e layouts guardados.</li><li><strong>Sugestões:</strong> As suas sugestões, problemas, votos e comentários.</li><li><strong>Lista de Assistir:</strong> Filmes e séries guardados.</li><li><strong>AirType:</strong> Notas e sessões de escrita guardadas.</li><li><strong>Pixel Art:</strong> Desenhos e dados de tela guardados.</li><li><strong>Partituras:</strong> A sua biblioteca pessoal de partituras.</li><li><strong>Flipbook:</strong> Animações e manifestos de desenho.</li><li><strong>Placares Esportivos:</strong> Equipas e ligas favoritas.</li></ul>",
    "privacy.section.5.title": "5. Dados Apenas Locais",
    "privacy.section.5.body": "<p>As seguintes apps armazenam dados <strong>apenas</strong> no seu dispositivo específico via <code>localStorage</code> do navegador (ou são puramente efêmeras):</p><ul><li><strong>Navegador:</strong> O seu histórico de navegação.</li><li><strong>Idiomas:</strong> Unidades completadas e estatísticas.</li><li><strong>Decidir:</strong> Opções e listas guardadas.</li><li><strong>Bloco de Desenho (Napkin):</strong> Os desenhos não são guardados e são apagados ao sair.</li><li><strong>Leitor ePub:</strong> Ferramenta para adicionar livros; não guarda dados por si só.</li><li><strong>Sites E-ink:</strong> Lista de links curada.</li><li><strong>Temporizador Pomodoro:</strong> Configurações efêmeras.</li><li><strong>Calculadora e Conversor:</strong> Nenhum dado é guardado.</li><li><strong>Respiração:</strong> Configurações efêmeras.</li><li><strong>Jogos de Um Jogador:</strong> 2048, Wordle, Quebra-cabeça, Solitário, Sopa de Letras, Doom, etc.</li><li><strong>Jogos Passar e Jogar:</strong> O estado de jogo para Batalha Naval, Xadrez, Damas, Conecta 4, etc. não é sincronizado com a nuvem.</li><li><strong>Freewrite:</strong> Códigos de conexão são efêmeros.</li></ul>",
    "privacy.section.6.title": "6. Serviços de Terceiros",
    "privacy.section.6.body": "<p>O ReKindle conecta-se às seguintes APIs públicas de terceiros para fornecer funcionalidade:</p><ul><li><strong>Google Gemini e OpenAI:</strong> Utilizados para a inteligência do Assistente de IA (Chat).</li><li><strong>Cloudflare Workers:</strong> Utilizados para intermediar solicitações de IA e reconhecimento de escrita.</li><li><strong>Gutendex:</strong> Utilizado pelo Leitor para buscar e baixar livros de domínio público.</li><li><strong>Standard Ebooks:</strong> Utilizado para obter feeds RSS de novos lançamentos.</li><li><strong>Open Library:</strong> Utilizado para busca de livros e imagens de capa.</li><li><strong>DictionaryAPI:</strong> Utilizado pelo Dicionário para definições.</li><li><strong>Open-Meteo:</strong> Utilizado para dados meteorológicos.</li><li><strong>Yahoo Finance:</strong> Utilizado para obter cotações de ações.</li><li><strong>OpenStreetMap:</strong> Utilizado pela app de Mapas para blocos e rotas.</li><li><strong>Reddit:</strong> Utilizado para obter postagens e comentários públicos.</li><li><strong>Wikipedia:</strong> Utilizado para obter eventos históricos diários e artigos.</li><li><strong>GitHub:</strong> Utilizado como fonte de dados para Palavras Cruzadas e Soletando.</li><li><strong>rss2json:</strong> Utilizado pelas apps de Jornal e Leitor RSS.</li><li><strong>Open Trivia Database:</strong> Utilizado pela app de Trivia para perguntas.</li><li><strong>Stripe:</strong> Utilizado para processar pagamentos de forma segura para o ReKindle+.</li></ul>",
    "privacy.section.7.title": "7. Contato",
    "privacy.section.7.body": "<p>Se tiver dúvidas sobre esta política,</p><p>Contato: <strong>contact@ukiyomusic.com</strong></p>"
}