{
    "privacy.title": "Политика конфиденциальности",
    "privacy.header": "Политика конфиденциальности ReKindle",
    "privacy.last_updated": "Последнее обновление: 3 февраля 2026 г.",
    "privacy.intro": "ReKindle — это веб-приложение, предназначенное для предоставления панели управления для устройств с электронными чернилами (E-ink). Мы уделяем первостепенное внимание вашей конфиденциальности и прозрачности.",
    "privacy.section.1.title": "1. Архитектура данных",
    "privacy.section.1.body": "<p>ReKindle работает в двух режимах:</p><ul><li><strong>Гостевой режим:</strong> Все данные хранятся локально в Local Storage вашего браузера. На наши серверы ничего не отправляется. Если вы очистите кэш браузера, эти данные будут потеряны.</li><li><strong>Режим входа в систему:</strong> Данные для поддерживаемых приложений безопасно синхронизируются с Google Firebase (Firestore и Realtime Database) под вашим уникальным идентификатором пользователя (User ID). Это позволяет вам получать доступ к вашим данным на нескольких устройствах.</li></ul>",
    "privacy.section.2.title": "2. Данные пользователя Google (Gmail, Задачи, Календарь, Контакты)",
    "privacy.section.2.body": "<p>ReKindle предлагает интеграцию со сервисами Google для отображения ваших личных данных на устройстве. Эта функция является необязательной.</p><ul><li><strong>Gmail (Ограниченный доступ):</strong> Если включено, ReKindle получает доступ к вашим сообщениям Gmail, чтобы вы могли читать, создавать, архивировать, удалять и отправлять электронные письма прямо с панели управления. Используются ограниченные области доступа (scopes) для обеспечения полной функциональности управления почтой.</li><li><strong>Доступ:</strong> Приложение запрашивает доступ к вашим данным Google только после того, как вы явно нажмете «Войти» (в конкретном приложении или настройках) и предоставите разрешение через безопасный протокол Google OAuth 2.0.</li><li><strong>Использование:</strong> Эти данные извлекаются напрямую с серверов Google в браузер вашего устройства. Они используются исключительно для отображения и редактирования в панели управления ReKindle.</li><li><strong>Хранение:</strong> Ваши письма, задачи, события календаря и контакты Google <strong>не</strong> хранятся на наших серверах Firebase. Временные токены доступа сохраняются в Local Storage вашего браузера для поддержания сеанса.</li><li><strong>Хранение и удаление:</strong> Мы придерживаемся строгой политики минимизации данных. Поскольку данные пользователя Google не хранятся на наших постоянных серверах, долгосрочное хранение отсутствует. Данные кэшируются локально в вашем браузере на время сеанса и <strong>удаляются немедленно</strong> после выхода из системы или очистки кэша браузера. Вы можете отозвать доступ ReKindle в любое время через настройки безопасности вашей учетной записи Google, что немедленно прекратит нашу возможность отображать эти данные.</li><li><strong>Передача:</strong> Мы не передаем ваши данные пользователя Google третьим лицам.</li></ul><p><em>Использование ReKindle и передача в любое другое приложение информации, полученной от API Google, будет соответствовать <a href=\"https://developers.google.com/terms/api-services-user-data-policy\" target=\"_blank\" style=\"color:black;\">Политике в отношении данных пользователей служб Google API</a>, включая требования к ограниченному использованию.</em></p>",
    "privacy.section.3.title": "3. Механизмы защиты данных",
    "privacy.section.3.body": "<p>Мы используем стандартные для отрасли меры безопасности для обеспечения конфиденциальности и целостности ваших конфиденциальных данных.</p><ul><li><strong>Шифрование при передаче:</strong> Все данные, передаваемые между вашим устройством, нашими серверами и сторонними сервисами (включая API Google), шифруются с использованием <strong>Transport Layer Security (TLS/SSL)</strong>.</li><li><strong>Шифрование в состоянии покоя:</strong> Любые данные, синхронизируемые с нашей базой данных (как указано в Разделе 4), размещаются в Google Firebase (Firestore и Realtime Database), который шифрует данные в состоянии покоя с использованием <strong>256-битного стандарта шифрования (AES-256)</strong>.</li><li><strong>Безопасный доступ:</strong> Доступ к личным данным ограничен аутентифицированным пользователем. Мы используем безопасные токены (OAuth 2.0) для управления авторизацией без хранения вашего реального пароля Google.</li></ul>",
    "privacy.section.4.title": "4. Данные синхронизации Firebase Cloud",
    "privacy.section.4.body": "<p>Если вы создадите учетную запись ReKindle, следующие данные приложений будут сохранены в нашей базе данных (Google Firebase) для включения функций синхронизации на ваших устройствах:</p><ul><li><strong>Задачи и Quick ToDo:</strong> Задачи, созданные в основном приложении «Задачи» или созданные рукописным вводом в Quick ToDo.</li><li><strong>Календарь (Нативный):</strong> События, добавленные в нативный календарь, если Google Календарь не включен.</li><li><strong>Контакты (Нативные):</strong> Контакты, добавленные вручную в нативную адресную книгу, если Google Контакты не включены.</li><li><strong>Заметки:</strong> Текстовое содержимое и временные метки ваших заметок.</li><li><strong>Читалка:</strong> Индекс вашей библиотеки и прогресс чтения (позиция CFI) для ваших книг. Сами файлы книг хранятся локально в кэше браузера (IndexedDB) для экономии трафика, но метаданные синхронизируются.</li><li><strong>Настройки:</strong> Общие предпочтения, выбор обоев, переключатели интеграции и ваши пользовательские ключи API ИИ или сторонние токены (хранятся в закрытой коллекции `pro_data` для пользователей Pro).</li><li><strong>Часы:</strong> Ваши сохраненные города и домашнее местоположение для Мирового времени.</li><li><strong>Кроссворд и Мини-кроссворд:</strong> Текущее состояние головоломки и прогресс сетки.</li><li><strong>Судоку:</strong> Текущее состояние головоломки и пометки карандашом.</li><li><strong>Японские кроссворды (Picross):</strong> Прогресс головоломки и решенные состояния.</li><li><strong>Сапер:</strong> Текущее состояние игры и таймер.</li><li><strong>Nerdle:</strong> Ежедневное состояние игры и догадки.</li><li><strong>Шахматы и Шашки:</strong> Статистика побед/поражений/ничьих.</li><li><strong>Таблицы лидеров:</strong> Рекорды для <strong>Блоки (Тетрис)</strong>, <strong>Змейка</strong>, <strong>Викторина</strong>, <strong>Ханойская башня</strong>, <strong>Lights Out</strong>, <strong>Марио</strong>, <strong>Дино</strong>, <strong>Питомец</strong> и <strong>Block Blast</strong> хранятся публично и связаны с вашим именем пользователя.</li><li><strong>Интерактивное чтение:</strong> Ваша библиотека сохраненных текстовых приключений и прогресс чтения.</li><li><strong>Аккорды:</strong> Ваши сохраненные песни и листы аккордов.</li><li><strong>Викторина:</strong> Ваша личная история игр и статистика.</li><li><strong>Журнал чтения:</strong> Ежедневное отслеживание длительности чтения.</li><li><strong>Трекер привычек:</strong> Ваши привычки и история выполнения.</li><li><strong>Акции:</strong> Список тикеров акций, за которыми вы следите.</li><li><strong>Кулинарная книга:</strong> Рецепты, которые вы сохраняете.</li><li><strong>RSS-ридер:</strong> URL-адреса ваших подписок.</li><li><strong>Reddit:</strong> Ваш список сохраненных сабреддитов.</li><li><strong>Карточки:</strong> Ваши колоды, карточки и интервалы обучения.</li><li><strong>Обратный отсчет:</strong> Ваши сохраненные таймеры событий.</li><li><strong>Spellbound (Орфография):</strong> Ваши ежедневные найденные слова.</li><li><strong>Слова (Эрудит):</strong> Состояние многопользовательской игры и история ходов.</li><li><strong>KindleChat:</strong> Сообщения, отправленные в чатах, хранятся в <strong>Realtime Database</strong> для обеспечения высокой производительности мгновенного общения.</li><li><strong>Freewrite:</strong> Активные сеансы письма и сохраненные документы.</li><li><strong>Mindmap (Интеллект-карта):</strong> Сохраненные интеллект-карты и макеты.</li><li><strong>Предложения:</strong> Ваши отправленные предложения, проблемы, голоса и комментарии.</li><li><strong>Список просмотра:</strong> Ваши сохраненные фильмы и сериалы.</li><li><strong>AirType:</strong> Ваши сохраненные заметки и сеансы письма.</li><li><strong>Пиксель-арт:</strong> Ваши сохраненные рисунки, данные холста и библиотека манифестов.</li><li><strong>Ноты:</strong> Ваша личная библиотека партитур. (Примечание: партитуры, которые вы явно загружаете в «Онлайн-магазин», являются общедоступными).</li><li><strong>Флипбук:</strong> Ваши анимации и манифесты рисунков синхронизируются для возможности редактирования на разных устройствах.</li><li><strong>Счет:</strong> Ваши сохраненные любимые команды и лиги для приложения Спорт.</li></ul>",
    "privacy.section.5.title": "5. Только локальные данные",
    "privacy.section.5.body": "<p>Следующие приложения хранят данные <strong>только</strong> на вашем конкретном устройстве через <code>localStorage</code> браузера (или являются чисто эфемерными), независимо от статуса входа:</p><ul><li><strong>Браузер:</strong> Ваша история просмотра.</li><li><strong>Язык:</strong> Ваши завершенные модули, прогресс уроков и статистика словаря.</li><li><strong>Decide (Решение):</strong> Ваши сохраненные варианты решений и списки.</li><li><strong>Блокнот (Napkin):</strong> Рисунки не сохраняются в постоянном хранилище и удаляются при выходе или обновлении.</li><li><strong>ePub Reader:</strong> Приложение ePub — это инструмент для добавления книг в вашу основную библиотеку Читалки. Оно само по себе не хранит данные.</li><li><strong>Сайты E-ink:</strong> Это приложение представляет собой курируемый список ссылок и не хранит данные пользователя.</li><li><strong>Таймер Pomodoro:</strong> Настройки сеанса эфемерны и не сохраняются.</li><li><strong>Калькулятор и Конвертер:</strong> Данные не хранятся.</li><li><strong>Дыхание:</strong> Настройки сеанса эфемерны.</li><li><strong>Одиночные игры:</strong> 2048 (Рекорд и Состояние игры), Wordle (Ежедневный прогресс), Пазл, Память, Пасьянс, Связи (Connections), Поиск слов, Анаграммы, Виселица, Блэкджек, Бильярд (8-Ball), Взломщик кодов и Doom.</li><li><strong>Игры «Передай и играй»:</strong> Состояние игры для Морского боя (2 игрока), Шахмат, Шашек, Четыре в ряд, Крестиков-ноликов и Техасского холдема не синхронизируется с облаком.</li><li><strong>Freewrite:</strong> Коды подключения Хост/Клиент эфемерны и не сохраняются постоянно.</li></ul>",
    "privacy.section.6.title": "6. Сторонние сервисы",
    "privacy.section.6.body": "<p>ReKindle подключается к следующим публичным API сторонних сервисов для обеспечения функциональности:</p><ul><li><strong>Google Gemini и OpenAI:</strong> Используются для интеллекта ИИ-помощника (Чат). Ваши запросы отправляются в эти службы через наш безопасный прокси.</li><li><strong>Cloudflare Workers:</strong> Используются для проксирования запросов к ИИ-помощнику и распознавания рукописного ввода Quick ToDo.</li><li><strong>Gutendex:</strong> Используется приложением Читалка для поиска и загрузки электронных книг, являющихся общественным достоянием.</li><li><strong>Standard Ebooks:</strong> Используется приложением Standard Ebooks для получения RSS-каналов.</li><li><strong>Open Library:</strong> Используется для поиска книг и изображений обложек.</li><li><strong>DictionaryAPI:</strong> Используется приложением Словарь для определений.</li><li><strong>Open-Meteo:</strong> Используется для данных о погоде.</li><li><strong>Yahoo Finance:</strong> Используется для получения котировок акций.</li><li><strong>OpenStreetMap:</strong> Используется приложением Карты для тайлов и маршрутизации.</li><li><strong>Reddit:</strong> Используется для получения публичных постов и комментариев.</li><li><strong>Wikipedia:</strong> Используется для получения исторических событий дня и энциклопедических статей.</li><li><strong>GitHub:</strong> Используется как источник данных для Кроссворда и Spellbound.</li><li><strong>rss2json:</strong> Используется приложениями Газета и RSS-ридер.</li><li><strong>Open Trivia Database:</strong> Используется приложением Викторина для вопросов.</li><li><strong>Stripe:</strong> Используется для безопасной обработки платежей за ReKindle+.</li></ul>",
    "privacy.section.7.title": "7. Контакты",
    "privacy.section.7.body": "<p>Если у вас есть вопросы по этой политике,</p><p>Контакт: <strong>contact@ukiyomusic.com</strong></p>"
}