{
    "privacy.title": "Chính sách bảo mật",
    "privacy.header": "Chính sách bảo mật cho ReKindle",
    "privacy.last_updated": "Cập nhật lần cuối: ngày 3 tháng 2 năm 2026",
    "privacy.intro": "ReKindle là một ứng dụng web được thiết kế để cung cấp bảng điều khiển cho các thiết bị E-ink. Chúng tôi ưu tiên quyền riêng tư và sự minh bạch của bạn.",
    "privacy.section.1.title": "1. Kiến trúc dữ liệu",
    "privacy.section.1.body": "<p>ReKindle hoạt động ở hai chế độ:</p><ul><li><strong>Chế độ Khách:</strong> Tất cả dữ liệu được lưu trữ cục bộ trong Local Storage của trình duyệt. Không có gì được gửi đến máy chủ của chúng tôi. Nếu bạn xóa bộ nhớ cache của trình duyệt, dữ liệu này sẽ bị mất.</li><li><strong>Chế độ Đăng nhập:</strong> Dữ liệu cho các ứng dụng được hỗ trợ được đồng bộ hóa an toàn với Google Firebase (Firestore & Realtime Database) dưới ID người dùng duy nhất của bạn. Điều này cho phép bạn truy cập dữ liệu của mình trên nhiều thiết bị.</li></ul>",
    "privacy.section.2.title": "2. Dữ liệu người dùng Google (Gmail, Tác vụ, Lịch, Danh bạ)",
    "privacy.section.2.body": "<p>ReKindle cung cấp tích hợp với các dịch vụ của Google để hiển thị dữ liệu cá nhân của bạn trên thiết bị. Tính năng này là tùy chọn.</p><ul><li><strong>Gmail (Phạm vi hạn chế):</strong> Nếu được bật, ReKindle truy cập tin nhắn Gmail của bạn để cho phép bạn đọc, soạn, lưu trữ, xóa và gửi email trực tiếp từ bảng điều khiển. Điều này sử dụng các phạm vi hạn chế để cung cấp chức năng quản lý thư đầy đủ.</li><li><strong>Truy cập:</strong> Ứng dụng chỉ yêu cầu quyền truy cập vào dữ liệu Google của bạn sau khi bạn nhấp vào \"Đăng nhập\" một cách rõ ràng (trong ứng dụng hoặc cài đặt cụ thể) và cấp quyền thông qua giao thức OAuth 2.0 an toàn của Google.</li><li><strong>Sử dụng:</strong> Dữ liệu này được lấy trực tiếp từ máy chủ của Google đến trình duyệt trên thiết bị của bạn. Nó chỉ được sử dụng để hiển thị và chỉnh sửa trong bảng điều khiển ReKindle.</li><li><strong>Lưu trữ:</strong> Google Mail, Tác vụ, Sự kiện Lịch và Danh bạ của bạn <strong>không</strong> được lưu trữ trên máy chủ Firebase của chúng tôi. Mã thông báo truy cập tạm thời được lưu trữ trong Local Storage của trình duyệt để duy trì phiên của bạn.</li><li><strong>Lưu giữ & Xóa:</strong> Chúng tôi tuân thủ chính sách giảm thiểu dữ liệu nghiêm ngặt. Vì Dữ liệu người dùng Google không được lưu trữ trên các máy chủ liên tục của chúng tôi, nên không có việc lưu giữ lâu dài. Dữ liệu được lưu trong bộ nhớ cache cục bộ trong trình duyệt của bạn trong suốt thời gian phiên của bạn và <strong>bị xóa ngay lập tức</strong> khi đăng xuất hoặc xóa bộ nhớ cache của trình duyệt. Bạn có thể thu hồi quyền truy cập của ReKindle bất kỳ lúc nào thông qua cài đặt bảo mật Tài khoản Google của mình, điều này sẽ ngay lập tức chấm dứt khả năng hiển thị dữ liệu này của chúng tôi.</li><li><strong>Chia sẻ:</strong> Chúng tôi không chia sẻ dữ liệu người dùng Google của bạn với bất kỳ bên thứ ba nào.</li></ul><p><em>Việc sử dụng và chuyển giao thông tin nhận được từ Google API sang bất kỳ ứng dụng nào khác của ReKindle sẽ tuân thủ <a href=\"https://developers.google.com/terms/api-services-user-data-policy\" target=\"_blank\" style=\"color:black;\">Chính sách dữ liệu người dùng của Dịch vụ API của Google</a>, bao gồm các yêu cầu về Sử dụng hạn chế.</em></p>",
    "privacy.section.3.title": "3. Cơ chế bảo vệ dữ liệu",
    "privacy.section.3.body": "<p>Chúng tôi sử dụng các biện pháp bảo mật tiêu chuẩn ngành để đảm bảo tính bảo mật và toàn vẹn cho dữ liệu nhạy cảm của bạn.</p><ul><li><strong>Mã hóa khi truyền:</strong> Tất cả dữ liệu được truyền giữa thiết bị của bạn, máy chủ của chúng tôi và các dịch vụ của bên thứ ba (bao gồm Google API) đều được mã hóa bằng <strong>Bảo mật lớp vận chuyển (TLS/SSL)</strong>.</li><li><strong>Mã hóa khi nghỉ:</strong> Bất kỳ dữ liệu nào được đồng bộ hóa với cơ sở dữ liệu của chúng tôi (như chi tiết trong Phần 4) đều được lưu trữ trên Google Firebase (Firestore & Realtime Database), mã hóa dữ liệu khi nghỉ bằng <strong>Tiêu chuẩn mã hóa nâng cao 256-bit (AES-256)</strong>.</li><li><strong>Truy cập an toàn:</strong> Truy cập vào dữ liệu cá nhân bị hạn chế đối với người dùng đã xác thực. Chúng tôi sử dụng mã thông báo an toàn (OAuth 2.0) để quản lý ủy quyền mà không lưu trữ mật khẩu Google thực của bạn.</li></ul>",
    "privacy.section.4.title": "4. Dữ liệu đồng bộ hóa đám mây Firebase",
    "privacy.section.4.body": "<p>Nếu bạn tạo tài khoản ReKindle, dữ liệu ứng dụng sau đây sẽ được lưu trữ trong cơ sở dữ liệu của chúng tôi (Google Firebase) để bật các tính năng đồng bộ hóa trên các thiết bị của bạn:</p><ul><li><strong>Tác vụ & Việc cần làm nhanh:</strong> Các mục cần làm được tạo trong ứng dụng Tác vụ chính hoặc được tạo thông qua chữ viết tay trong Việc cần làm nhanh.</li><li><strong>Lịch (Cục bộ):</strong> Các sự kiện được thêm vào lịch cục bộ nếu Lịch Google không được bật.</li><li><strong>Danh bạ (Cục bộ):</strong> Danh bạ được thêm thủ công vào sổ địa chỉ cục bộ nếu Danh bạ Google không được bật.</li><li><strong>Ghi chú:</strong> Nội dung văn bản và dấu thời gian của các ghi chú của bạn.</li><li><strong>Trình đọc:</strong> Chỉ mục thư viện và tiến trình đọc (vị trí CFI) cho sách của bạn. Các tệp sách thực tế được lưu trữ cục bộ trong bộ nhớ cache của trình duyệt (IndexedDB) để tiết kiệm băng thông, nhưng siêu dữ liệu được đồng bộ hóa.</li><li><strong>Cài đặt:</strong> Tùy chọn chung, lựa chọn hình nền, bật tắt tích hợp và các khóa AI API tùy chỉnh hoặc mã thông báo của bên thứ ba (được lưu trữ trong bộ sưu tập `pro_data` riêng tư cho người dùng Pro).</li><li><strong>Đồng hồ:</strong> Các thành phố đã lưu và vị trí nhà của bạn cho Đồng hồ thế giới.</li><li><strong>Ô chữ & Ô chữ Mini:</strong> Trạng thái câu đố hiện tại và tiến trình lưới.</li><li><strong>Sudoku:</strong> Trạng thái câu đố hiện tại và các dấu bút chì.</li><li><strong>Nonograms (Picross):</strong> Tiến trình câu đố và trạng thái đã giải.</li><li><strong>Dò mìn:</strong> Trạng thái trò chơi hiện tại và bộ đếm thời gian.</li><li><strong>Nerdle:</strong> Trạng thái trò chơi hàng ngày và các lần đoán.</li><li><strong>Cờ vua & Cờ đam:</strong> Thống kê Thắng/Thua/Hòa.</li><li><strong>Bảng xếp hạng:</strong> Điểm cao cho <strong>Xếp gạch (Tetris)</strong>, <strong>Rắn săn mồi</strong>, <strong>Câu đố vui</strong>, <strong>Tháp Hà Nội</strong>, <strong>Tắt đèn</strong>, <strong>Mario</strong>, <strong>Khủng long</strong>, <strong>Thú cưng</strong>, và <strong>Block Blast</strong> được lưu trữ công khai liên kết với tên người dùng của bạn.</li><li><strong>Trình đọc tương tác:</strong> Thư viện các cuộc phiêu lưu văn bản đã lưu và tiến trình đọc của bạn.</li><li><strong>Hợp âm:</strong> Các bài hát và bảng hợp âm đã lưu của bạn.</li><li><strong>Câu đố vui:</strong> Lịch sử trò chơi và thống kê cá nhân của bạn.</li><li><strong>Nhật ký đọc:</strong> Theo dõi thời gian đọc hàng ngày.</li><li><strong>Theo dõi thói quen:</strong> Thói quen và lịch sử hoàn thành của bạn.</li><li><strong>Chứng khoán:</strong> Danh sách các mã chứng khoán bạn đang theo dõi.</li><li><strong>Sách nấu ăn:</strong> Các công thức nấu ăn bạn lưu.</li><li><strong>Trình đọc RSS:</strong> Các URL nguồn cấp dữ liệu đã đăng ký của bạn.</li><li><strong>Reddit:</strong> Danh sách các subreddit đã lưu của bạn.</li><li><strong>Flashcards:</strong> Các bộ thẻ, thẻ và khoảng thời gian học của bạn.</li><li><strong>Đếm ngược:</strong> Các bộ đếm thời gian sự kiện đã lưu của bạn.</li><li><strong>Spellbound (Spelling Bee):</strong> Các từ bạn tìm thấy hàng ngày.</li><li><strong>Words (Scrabble):</strong> Trạng thái trò chơi nhiều người chơi và lịch sử lượt chơi.</li><li><strong>KindleChat:</strong> Tin nhắn được gửi trong phòng trò chuyện được lưu trữ trong <strong>Realtime Database</strong> để tạo điều kiện cho giao tiếp tức thì hiệu suất cao.</li><li><strong>Freewrite:</strong> Các phiên viết đang hoạt động và tài liệu đã lưu.</li><li><strong>Sơ đồ tư duy:</strong> Các sơ đồ tư duy và bố cục đã lưu.</li><li><strong>Đề xuất:</strong> Các đề xuất, vấn đề, phiếu tán thành và bình luận đã gửi của bạn.</li><li><strong>Danh sách xem:</strong> Phim và chương trình TV đã lưu của bạn.</li><li><strong>AirType:</strong> Các ghi chú và phiên viết đã lưu của bạn.</li><li><strong>Pixel Art:</strong> Các bản vẽ, dữ liệu canvas và thư viện manifest đã lưu của bạn.</li><li><strong>Bản nhạc:</strong> Thư viện điểm số cá nhân của bạn. (Lưu ý: Điểm số bạn tải lên công khai 'Cửa hàng trực tuyến' là công khai).</li><li><strong>Sách lật:</strong> Các hoạt hình và manifest vẽ của bạn được đồng bộ hóa để cho phép chỉnh sửa trên nhiều thiết bị.</li><li><strong>Tỷ số:</strong> Các đội và giải đấu yêu thích đã lưu của bạn cho ứng dụng Thể thao.</li></ul>",
    "privacy.section.5.title": "5. Dữ liệu chỉ cục bộ",
    "privacy.section.5.body": "<p>Các ứng dụng sau đây lưu trữ dữ liệu <strong>chỉ</strong> trên thiết bị cụ thể của bạn thông qua trình duyệt <code>localStorage</code> (hoặc hoàn toàn là tạm thời), bất kể trạng thái đăng nhập:</p><ul><li><strong>Trình duyệt:</strong> Lịch sử duyệt web của bạn.</li><li><strong>Ngôn ngữ:</strong> Các đơn vị đã hoàn thành, tiến độ bài học và thống kê từ vựng của bạn.</li><li><strong>Quyết định:</strong> Các tùy chọn và danh sách quyết định đã lưu của bạn.</li><li><strong>Bảng phác thảo (Napkin):</strong> Các bản vẽ không được lưu vào bất kỳ bộ nhớ bền vững nào và sẽ bị xóa khi thoát hoặc làm mới.</li><li><strong>Trình đọc ePub:</strong> Ứng dụng ePub là một công cụ để thêm sách vào thư viện Trình đọc chính của bạn. Bản thân nó không lưu trữ dữ liệu.</li><li><strong>Trang web E-ink:</strong> Ứng dụng này là một danh sách liên kết được tuyển chọn và không lưu trữ bất kỳ dữ liệu người dùng nào.</li><li><strong>Hẹn giờ Pomodoro:</strong> Cài đặt phiên là tạm thời và không được lưu.</li><li><strong>Máy tính & Bộ chuyển đổi:</strong> Không có dữ liệu nào được lưu trữ.</li><li><strong>Hô hấp:</strong> Cài đặt phiên là tạm thời.</li><li><strong>Trò chơi đơn:</strong> 2048 (Điểm cao & Trạng thái trò chơi), Wordle (Tiến độ hàng ngày), Ghép hình, Trí nhớ, Solitaire, Kết nối (Bindings), Tìm từ, Đảo chữ, Người treo cổ, Xì dách, Bida 8 bóng, Phá mã, và Doom.</li><li><strong>Trò chơi chuyền tay:</strong> Trạng thái trò chơi cho Tàu chiến 2 người, Cờ vua, Cờ đam, Cờ caro 4, Cờ caro, và Texas Hold'em không được đồng bộ hóa với đám mây.</li><li><strong>Freewrite:</strong> Mã kết nối Máy chủ/Máy khách là tạm thời và không được lưu trữ vĩnh viễn.</li></ul>",
    "privacy.section.6.title": "6. Dịch vụ bên thứ ba",
    "privacy.section.6.body": "<p>ReKindle kết nối với các API công cộng của bên thứ ba sau đây để cung cấp chức năng:</p><ul><li><strong>Google Gemini & OpenAI:</strong> Được sử dụng cho trí thông minh của Trợ lý AI (Trò chuyện). Các lời nhắc của bạn được gửi đến các dịch vụ này thông qua proxy an toàn của chúng tôi.</li><li><strong>Cloudflare Workers:</strong> Được sử dụng để proxy các yêu cầu cho Trợ lý AI và nhận dạng chữ viết tay Việc cần làm nhanh.</li><li><strong>Gutendex:</strong> Được ứng dụng Trình đọc sử dụng để tìm kiếm và tải xuống sách điện tử miền công cộng.</li><li><strong>Standard Ebooks:</strong> Được ứng dụng Standard Ebooks sử dụng để lấy nguồn cấp dữ liệu RSS.</li><li><strong>Open Library:</strong> Được sử dụng để tìm kiếm sách và ảnh bìa.</li><li><strong>DictionaryAPI:</strong> Được ứng dụng Từ điển sử dụng cho các định nghĩa.</li><li><strong>Open-Meteo:</strong> Được sử dụng cho dữ liệu thời tiết.</li><li><strong>Yahoo Finance:</strong> Được sử dụng để lấy báo giá chứng khoán.</li><li><strong>OpenStreetMap:</strong> Được ứng dụng Bản đồ sử dụng cho các ô và định tuyến.</li><li><strong>Reddit:</strong> Được sử dụng để lấy các bài đăng và bình luận công khai.</li><li><strong>Wikipedia:</strong> Được sử dụng để lấy các sự kiện lịch sử hàng ngày và các bài viết bách khoa toàn thư.</li><li><strong>GitHub:</strong> Được sử dụng làm nguồn dữ liệu cho Ô chữ và Spellbound.</li><li><strong>rss2json:</strong> Được sử dụng bởi các ứng dụng Báo và Trình đọc RSS.</li><li><strong>Open Trivia Database:</strong> Được ứng dụng Câu đố vui sử dụng cho các câu hỏi.</li><li><strong>Stripe:</strong> Được sử dụng để xử lý thanh toán ReKindle+ một cách an toàn.</li></ul>",
    "privacy.section.7.title": "7. Liên hệ",
    "privacy.section.7.body": "<p>Nếu bạn có câu hỏi về chính sách này,</p><p>Liên hệ: <strong>contact@ukiyomusic.com</strong></p>"
}