{
    "privacy.title": "Politique de Confidentialité",
    "privacy.header": "Politique de Confidentialité pour ReKindle",
    "privacy.last_updated": "Dernière mise à jour : 3 février 2026",
    "privacy.intro": "ReKindle est une application web conçue pour fournir un tableau de bord pour les appareils à encre électronique (E-ink). Nous accordons la priorité à votre vie privée et à la transparence.",
    "privacy.section.1.title": "1. Architecture des Données",
    "privacy.section.1.body": "<p>ReKindle fonctionne selon deux modes :</p><ul><li><strong>Mode Invité :</strong> Toutes les données sont stockées localement dans le stockage local (Local Storage) de votre navigateur. Rien n'est envoyé à nos serveurs. Si vous videz le cache de votre navigateur, ces données sont perdues.</li><li><strong>Mode Connecté :</strong> Les données des applications prises en charge sont synchronisées de manière sécurisée avec Google Firebase (Firestore et Realtime Database) sous votre identifiant utilisateur unique. Cela vous permet d'accéder à vos données sur plusieurs appareils.</li></ul>",
    "privacy.section.2.title": "2. Données Utilisateur Google (Gmail, Tâches, Calendrier, Contacts)",
    "privacy.section.2.body": "<p>ReKindle propose une intégration avec les services Google pour afficher vos données personnelles sur votre appareil. Cette fonctionnalité est facultative.</p><ul><li><strong>Gmail (Portée Restreinte) :</strong> S'il est activé, ReKindle accède à vos messages Gmail pour vous permettre de lire, rédiger, archiver, supprimer et envoyer des e-mails directement depuis le tableau de bord. Cela utilise des portées (scopes) restreintes pour fournir une fonctionnalité complète de gestion du courrier.</li><li><strong>Accès :</strong> L'application demande l'accès à vos données Google uniquement après avoir explicitement cliqué sur « Connexion » (dans l'application ou les paramètres spécifiques) et accordé l'autorisation via le protocole sécurisé OAuth 2.0 de Google.</li><li><strong>Utilisation :</strong> Ces données sont récupérées directement depuis les serveurs de Google vers le navigateur de votre appareil. Elles sont utilisées uniquement pour l'affichage et l'édition au sein du tableau de bord ReKindle.</li><li><strong>Stockage :</strong> Vos e-mails, tâches, événements de calendrier et contacts Google <strong>ne sont pas</strong> stockés sur nos serveurs Firebase. Des jetons d'accès temporaires sont stockés dans le stockage local de votre navigateur pour maintenir votre session.</li><li><strong>Rétention et Suppression :</strong> Nous adhérons à une politique stricte de minimisation des données. Puisque les données utilisateur Google ne sont pas stockées sur nos serveurs persistants, il n'y a pas de rétention à long terme. Les données sont mises en cache localement dans votre navigateur pour la durée de votre session et sont <strong>supprimées immédiatement</strong> lors de la déconnexion ou de la suppression du cache de votre navigateur. Vous pouvez révoquer l'accès de ReKindle à tout moment via les paramètres de sécurité de votre compte Google, ce qui cessera immédiatement notre capacité à afficher ces données.</li><li><strong>Partage :</strong> Nous ne partageons pas vos données utilisateur Google avec des tiers.</li></ul><p><em>L'utilisation par ReKindle et le transfert vers toute autre application des informations reçues des API Google respecteront la <a href=\"https://developers.google.com/terms/api-services-user-data-policy\" target=\"_blank\" style=\"color:black;\">Politique relative aux données utilisateur des services API Google</a>, y compris les exigences d'utilisation limitée.</em></p>",
    "privacy.section.3.title": "3. Mécanismes de Protection des Données",
    "privacy.section.3.body": "<p>Nous employons des mesures de sécurité standard de l'industrie pour assurer la confidentialité et l'intégrité de vos données sensibles.</p><ul><li><strong>Chiffrement en Transit :</strong> Toutes les données transmises entre votre appareil, nos serveurs et les services tiers (y compris les API Google) sont chiffrées à l'aide de <strong>Transport Layer Security (TLS/SSL)</strong>.</li><li><strong>Chiffrement au Repos :</strong> Toutes les données synchronisées avec notre base de données (comme détaillé dans la section 4) sont hébergées sur Google Firebase (Firestore et Realtime Database), qui chiffre les données au repos en utilisant <strong>256-bit Advanced Encryption Standard (AES-256)</strong>.</li><li><strong>Accès Sécurisé :</strong> L'accès aux données personnelles est limité à l'utilisateur authentifié. Nous utilisons des jetons sécurisés (OAuth 2.0) pour gérer l'autorisation sans stocker votre mot de passe Google réel.</li></ul>",
    "privacy.section.4.title": "4. Données de Synchronisation Cloud Firebase",
    "privacy.section.4.body": "<p>Si vous créez un compte ReKindle, les données d'application suivantes sont stockées dans notre base de données (Google Firebase) pour permettre les fonctionnalités de synchronisation sur vos appareils :</p><ul><li><strong>Tâches et Quick ToDo :</strong> Éléments à faire créés dans l'application principale Tâches ou générés via l'écriture manuscrite dans Quick ToDo.</li><li><strong>Calendrier (Natif) :</strong> Événements ajoutés au calendrier natif si Google Calendar n'est pas activé.</li><li><strong>Contacts (Natif) :</strong> Contacts ajoutés manuellement au carnet d'adresses natif si Google Contacts n'est pas activé.</li><li><strong>Notes :</strong> Le contenu textuel et les horodatages de vos notes.</li><li><strong>Lecteur :</strong> L'index de votre bibliothèque et la progression de lecture (position CFI) de vos livres. Les fichiers de livres réels sont stockés localement dans le cache de votre navigateur (IndexedDB) pour économiser de la bande passante, mais les métadonnées sont synchronisées.</li><li><strong>Paramètres :</strong> Préférences générales, sélection du fond d'écran, bascules d'intégration et vos clés API IA personnalisées ou jetons tiers (stockés dans une collection privée `pro_data` pour les utilisateurs Pro).</li><li><strong>Horloge :</strong> Vos villes enregistrées et votre emplacement domicile pour l'Horloge Mondiale.</li><li><strong>Mots Croisés et Mini Mots Croisés :</strong> État actuel du puzzle et progression de la grille.</li><li><strong>Sudoku :</strong> État actuel du puzzle et marques au crayon.</li><li><strong>Nonogrammes (Picross) :</strong> Progression du puzzle et états résolus.</li><li><strong>Démineur :</strong> État actuel du jeu et minuterie.</li><li><strong>Nerdle :</strong> État du jeu quotidien et devinettes.</li><li><strong>Échecs et Dames :</strong> Statistiques Victoire/Défaite/Nul.</li><li><strong>Classements :</strong> Les meilleurs scores pour <strong>Blocs (Tetris)</strong>, <strong>Snake</strong>, <strong>Trivia</strong>, <strong>Tour de Hanoï</strong>, <strong>Lights Out</strong>, <strong>Mario</strong>, <strong>Dino</strong>, <strong>Animal</strong> et <strong>Block Blast</strong> sont stockés publiquement liés à votre nom d'utilisateur.</li><li><strong>Lecteur Interactif :</strong> Votre bibliothèque d'aventures textuelles enregistrées et la progression de lecture.</li><li><strong>Accords :</strong> Vos chansons et feuilles d'accords enregistrées.</li><li><strong>Trivia :</strong> Votre historique de jeu personnel et vos statistiques.</li><li><strong>Journal de Lecture :</strong> Suivi quotidien de la durée de lecture.</li><li><strong>Suivi d'Habitudes :</strong> Vos habitudes et l'historique de réalisation.</li><li><strong>Bourse :</strong> La liste des symboles boursiers que vous suivez.</li><li><strong>Livre de Cuisine :</strong> Recettes que vous enregistrez.</li><li><strong>Lecteur RSS :</strong> Les URL de vos flux abonnés.</li><li><strong>Reddit :</strong> Votre liste de subreddits enregistrés.</li><li><strong>Flashcards :</strong> Vos paquets, cartes et intervalles d'étude.</li><li><strong>Compte à Rebours :</strong> Vos minuteurs d'événements enregistrés.</li><li><strong>Spellbound (Spelling Bee) :</strong> Vos mots trouvés quotidiennement.</li><li><strong>Mots (Scrabble) :</strong> État du jeu multijoueur et historique des tours.</li><li><strong>KindleChat :</strong> Les messages envoyés dans les salles de discussion sont stockés dans la <strong>Realtime Database</strong> pour faciliter une communication instantanée haute performance.</li><li><strong>Freewrite :</strong> Sessions d'écriture actives et documents enregistrés.</li><li><strong>Heuristique (Mindmap) :</strong> Cartes heuristiques enregistrées et mises en page.</li><li><strong>Suggestions :</strong> Vos suggestions soumises, problèmes, votes positifs et commentaires.</li><li><strong>Liste de visionnage :</strong> Vos films et séries TV enregistrés.</li><li><strong>AirType :</strong> Vos notes enregistrées et sessions d'écriture.</li><li><strong>Pixel Art :</strong> Vos dessins enregistrés, données de toile et bibliothèque de manifestes.</li><li><strong>Partitions :</strong> Votre bibliothèque personnelle de partitions. (Note : Les partitions que vous téléchargez explicitement sur le 'Magasin en ligne' sont publiques).</li><li><strong>Folioscope (Flipbook) :</strong> Vos animations et manifestes de dessin sont synchronisés pour permettre l'édition inter-appareils.</li><li><strong>Scores :</strong> Vos équipes et ligues favorites enregistrées pour l'application Sports.</li></ul>",
    "privacy.section.5.title": "5. Données Uniquement Locales",
    "privacy.section.5.body": "<p>Les applications suivantes stockent des données <strong>uniquement</strong> sur votre appareil spécifique via le <code>localStorage</code> du navigateur (ou sont purement éphémères), quel que soit le statut de connexion :</p><ul><li><strong>Navigateur :</strong> Votre historique de navigation.</li><li><strong>Langue :</strong> Vos unités terminées, la progression des leçons et les statistiques de vocabulaire.</li><li><strong>Décideur :</strong> Vos options de décision enregistrées et listes.</li><li><strong>Croquis (Napkin) :</strong> Les dessins ne sont pas enregistrés dans un stockage persistant et sont effacés à la sortie ou à l'actualisation.</li><li><strong>Lecteur ePub :</strong> L'application ePub est un outil pour ajouter des livres à votre bibliothèque principale. Elle ne stocke pas de données elle-même.</li><li><strong>Sites E-ink :</strong> Cette application est une liste organisée de liens et ne stocke aucune donnée utilisateur.</li><li><strong>Minuteur Pomodoro :</strong> Les paramètres de session sont éphémères et non enregistrés.</li><li><strong>Calculatrice et Convertisseur :</strong> Aucune donnée n'est stockée.</li><li><strong>Respiration :</strong> Les paramètres de session sont éphémères.</li><li><strong>Jeux Solo :</strong> 2048 (Meilleur Score et État du Jeu), Wordle (Progression Quotidienne), Puzzle, Memory, Solitaire, Connexions (Bindings), Mots Mêlés, Anagrammes, Pendu, Blackjack, Billard Américain (8-Ball), Codebreaker et Doom.</li><li><strong>Jeux Pass-and-Play :</strong> L'état du jeu pour Bataille Navale 2 Joueurs, Échecs, Dames, Puissance 4, Morpion et Texas Hold'em n'est pas synchronisé sur le cloud.</li><li><strong>Freewrite :</strong> Les codes de connexion Hôte/Client sont éphémères et ne sont pas stockés de manière permanente.</li></ul>",
    "privacy.section.6.title": "6. Services Tiers",
    "privacy.section.6.body": "<p>ReKindle se connecte aux API publiques tierces suivantes pour fournir des fonctionnalités :</p><ul><li><strong>Google Gemini et OpenAI :</strong> Utilisés pour l'intelligence de l'Assistant IA (Chat). Vos invites sont envoyées à ces services via notre proxy sécurisé.</li><li><strong>Cloudflare Workers :</strong> Utilisés pour relayer les demandes pour l'Assistant IA et la reconnaissance d'écriture manuscrite Quick ToDo.</li><li><strong>Gutendex :</strong> Utilisé par l'application Lecteur pour rechercher et télécharger des ebooks du domaine public.</li><li><strong>Standard Ebooks :</strong> Utilisé par l'application Standard Ebooks pour récupérer les flux RSS.</li><li><strong>Open Library :</strong> Utilisé pour la recherche de livres et les images de couverture.</li><li><strong>DictionaryAPI :</strong> Utilisé par l'application Dictionnaire pour les définitions.</li><li><strong>Open-Meteo :</strong> Utilisé pour les données météorologiques.</li><li><strong>Yahoo Finance :</strong> Utilisé pour récupérer les cotations boursières.</li><li><strong>OpenStreetMap :</strong> Utilisé par l'application Cartes pour les tuiles et l'itinéraire.</li><li><strong>Reddit :</strong> Utilisé pour récupérer les publications publiques et les commentaires.</li><li><strong>Wikipedia :</strong> Utilisé pour récupérer les événements historiques quotidiens et les articles encyclopédiques.</li><li><strong>GitHub :</strong> Utilisé comme sources de données pour Mots Croisés et Spellbound.</li><li><strong>rss2json :</strong> Utilisé par les applications Journal et Lecteur RSS.</li><li><strong>Open Trivia Database :</strong> Utilisé par l'application Trivia pour les questions.</li><li><strong>Stripe :</strong> Utilisé pour traiter en toute sécurité les paiements pour ReKindle+.</li></ul>",
    "privacy.section.7.title": "7. Contact",
    "privacy.section.7.body": "<p>Si vous avez des questions concernant cette politique,</p><p>Contact : <strong>contact@ukiyomusic.com</strong></p>"
}