{
    "privacy.title": "Polityka Prywatności",
    "privacy.header": "Polityka Prywatności ReKindle",
    "privacy.last_updated": "Ostatnia aktualizacja: luty 2026",
    "privacy.intro": "ReKindle to aplikacja internetowa zaprojektowana jako pulpit nawigacyjny dla urządzeń E-ink. Priorytetem jest dla nas Twoja prywatność i przejrzystość.",
    "privacy.section.1.title": "1. Architektura Danych",
    "privacy.section.1.body": "<p>ReKindle działa w dwóch trybach:</p><ul><li><strong>Tryb Gościa:</strong> Wszystkie dane są przechowywane lokalnie w pamięci przeglądarki (Local Storage). Nic nie jest wysyłane na nasze serwery. Jeśli wyczyścisz pamięć podręczną przeglądarki, dane te zostaną utracone.</li><li><strong>Tryb Zalogowany:</strong> Dane obsługiwanych aplikacji są bezpiecznie synchronizowane z Google Firebase (Firestore i Realtime Database) pod Twoim unikalnym identyfikatorem użytkownika. Pozwala to na dostęp do danych na wielu urządzeniach.</li></ul>",
    "privacy.section.2.title": "2. Dane Użytkownika Google (Gmail, Zadania, Kalendarz, Kontakty)",
    "privacy.section.2.body": "<p>ReKindle oferuje integrację z usługami Google w celu wyświetlania danych osobistych na Twoim urządzeniu. Ta funkcja jest opcjonalna.</p><ul><li><strong>Gmail (Ograniczony Zakres):</strong> Jeśli włączone, ReKindle uzyskuje dostęp do wiadomości Gmail, aby umożliwić czytanie, tworzenie, archiwizowanie, usuwanie i wysyłanie e-maili bezpośrednio z pulpitu. Wykorzystuje to ograniczone zakresy uprawnień, aby zapewnić pełną funkcjonalność zarządzania pocztą.</li><li><strong>Dostęp:</strong> Aplikacja prosi o dostęp do danych Google tylko po wyraźnym kliknięciu „Zaloguj się” (w konkretnej aplikacji lub ustawieniach) i udzieleniu zgody za pośrednictwem bezpiecznego protokołu Google OAuth 2.0.</li><li><strong>Użycie:</strong> Dane te są pobierane bezpośrednio z serwerów Google do przeglądarki Twojego urządzenia. Są używane wyłącznie do wyświetlania i edycji wewnątrz pulpitu ReKindle.</li><li><strong>Przechowywanie:</strong> Twoje e-maile Gmail, zadania, wydarzenia z kalendarza i kontakty <strong>nie</strong> są przechowywane na naszych serwerach Firebase. Tymczasowe tokeny dostępu są zapisywane w pamięci lokalnej przeglądarki, aby utrzymać sesję.</li><li><strong>Przechowywanie i Usuwanie:</strong> Stosujemy ścisłą politykę minimalizacji danych. Ponieważ dane użytkownika Google nie są przechowywane na naszych trwałych serwerach, nie ma długoterminowego przechowywania. Dane są buforowane lokalnie w przeglądarce podczas sesji i są <strong>natychmiast usuwane</strong> po wylogowaniu lub wyczyszczeniu pamięci podręcznej przeglądarki. Możesz w dowolnym momencie cofnąć dostęp ReKindle w ustawieniach bezpieczeństwa konta Google.</li><li><strong>Udostępnianie:</strong> Nie udostępniamy danych użytkownika Google stronom trzecim.</li></ul><p><em>Użycie i przesyłanie do dowolnej innej aplikacji informacji otrzymanych z interfejsów API Google przez ReKindle jest zgodne z <a href=\"https://developers.google.com/terms/api-services-user-data-policy\" target=\"_blank\" style=\"color:black;\">Polityką Danych Użytkownika Usług API Google</a>, w tym z wymaganiami ograniczonego użycia.</em></p>",
    "privacy.section.3.title": "3. Mechanizmy Ochrony Danych",
    "privacy.section.3.body": "<p>Stosujemy standardowe w branży środki bezpieczeństwa, aby zapewnić poufność i integralność Twoich wrażliwych danych.</p><ul><li><strong>Szyfrowanie w Transmisji:</strong> Wszystkie dane przesyłane między Twoim urządzeniem, naszymi serwerami i usługami stron trzecich (w tym API Google) są szyfrowane przy użyciu <strong>Transport Layer Security (TLS/SSL)</strong>.</li><li><strong>Szyfrowanie w Spoczynku:</strong> Wszelkie dane synchronizowane z naszą bazą danych (szczegółowo opisane w Sekcji 4) są hostowane w Google Firebase, które szyfruje dane w spoczynku przy użyciu <strong>256-bitowego standardu Advanced Encryption Standard (AES-256)</strong>.</li><li><strong>Bezpieczny Dostęp:</strong> Dostęp do danych osobowych jest ograniczony do uwierzytelnionego użytkownika. Używamy bezpiecznych tokenów (OAuth 2.0) do zarządzania autoryzacją bez przechowywania Twojego rzeczywistego hasła Google.</li></ul>",
    "privacy.section.4.title": "4. Synchronizacja Danych w Chmurze (Firebase)",
    "privacy.section.4.body": "<p>Jeśli utworzysz konto w ReKindle, następujące dane aplikacji są przechowywane w naszej bazie danych (Google Firebase), aby umożliwić synchronizację między urządzeniami:</p><ul><li><strong>Zadania i Szybkie ToDo:</strong> Pozycje zadań w głównej aplikacji lub generowane przez pismo ręczne.</li><li><strong>Kalendarz (Natywny):</strong> Wydarzenia dodane do kalendarza natywnego, jeśli Kalendarz Google nie jest włączony.</li><li><strong>Kontakty (Natywne):</strong> Kontakty dodane ręcznie do książki adresowej, jeśli Kontakty Google nie są włączone.</li><li><strong>Notatki:</strong> Treść tekstowa i znaczniki czasu Twoich notatek.</li><li><strong>Czytnik:</strong> Indeks Twojej biblioteki i postęp czytania (pozycja CFI) Twoich książek. Pliki książek są zapisywane lokalnie w pamięci podręcznej przeglądarki (IndexedDB), aby oszczędzać transfer, ale metadane są synchronizowane.</li><li><strong>Ustawienia:</strong> Ogólne preferencje, wybór tapety, integracje i Twoje niestandardowe klucze API AI (Pro).</li><li><strong>Zegar:</strong> Zapisane miasta i lokalizacja domowa.</li><li><strong>Krzyżówka:</strong> Aktualny stan łamigłówki i postęp siatki.</li><li><strong>Sudoku:</strong> Aktualny stan i notatki ołówkiem.</li><li><strong>Nonogramy (Picross):</strong> Postęp i rozwiązane stany.</li><li><strong>Saper:</strong> Aktualny stan gry i licznik czasu.</li><li><strong>Nerdle:</strong> Dzienny stan i domysły.</li><li><strong>Szachy i Warcaby:</strong> Statystyki wygranych/przegranych.</li><li><strong>Tablice Wyników:</strong> Najlepsze wyniki dla gier <strong>Klocki (Tetris)</strong>, <strong>Wąż</strong>, <strong>Trivia</strong>, <strong>Wieża Hanoi</strong>, <strong>Gaszenie Świateł</strong>, <strong>Mario</strong>, <strong>Dino</strong>, <strong>Zwierzak</strong> i <strong>Block Blast</strong> są przechowywane publicznie i powiązane z Twoją nazwą użytkownika.</li><li><strong>Czytnik Interaktywny:</strong> Biblioteka przygodówek tekstowych i postęp.</li><li><strong>Akordy:</strong> Zapisane piosenki i tabulatury.</li><li><strong>Trivia:</strong> Historia osobista i statystyki.</li><li><strong>Dziennik Czytania:</strong> Śledzenie dziennego czasu czytania.</li><li><strong>Nawyki:</strong> Twoje nawyki i historia ich wykonywania.</li><li><strong>Giełda:</strong> Lista obserwowanych symboli.</li><li><strong>Książka Kucharska:</strong> Zapisane przepisy.</li><li><strong>Czytnik RSS:</strong> Adresy URL subskrybowanych kanałów.</li><li><strong>Reddit:</strong> Lista zapisanych subredditów.</li><li><strong>Fiszki:</strong> Talie, karty i interwały nauki.</li><li><strong>Odliczanie:</strong> Zapisane liczniki wydarzeń.</li><li><strong>Literaki (Spellbound):</strong> Codziennie znalezione słowa.</li><li><strong>Słowa (Scrabble):</strong> Stan gier wieloosobowych i historia.</li><li><strong>KindleChat:</strong> Wiadomości wysyłane w pokojach czatu.</li><li><strong>Freewrite:</strong> Aktywne sesje pisania i dokumenty.</li><li><strong>Mapa Myśli:</strong> Zapisane mapy i układy.</li><li><strong>Sugestie:</strong> Twoje sugestie, zgłoszone problemy, głosy i komentarze.</li><li><strong>Lista do Obejrzenia:</strong> Zapisane filmy i seriale.</li><li><strong>AirType:</strong> Zapisane notatki i sesje pisania.</li><li><strong>Pixel Art:</strong> Zapisane rysunki i dane płótna.</li><li><strong>Nuty:</strong> Twoja osobista biblioteka nut.</li><li><strong>Flipbook:</strong> Animacje i manifesty rysunków.</li><li><strong>Wyniki Sportowe:</strong> Ulubione drużyny i ligi.</li></ul>",
    "privacy.section.5.title": "5. Dane Tylko Lokalne",
    "privacy.section.5.body": "<p>Następujące aplikacje przechowują dane <strong>tylko</strong> na Twoim konkretnym urządzeniu za pomocą <code>localStorage</code> przeglądarki (lub są całkowicie tymczasowe):</p><ul><li><strong>Przeglądarka:</strong> Twoja historia przeglądania.</li><li><strong>Języki:</strong> Ukończone jednostki i statystyki.</li><li><strong>Decyzje:</strong> Zapisane opcje i listy.</li><li><strong>Szkicownik (Napkin):</strong> Rysunki nie są zapisywane i znikają po wyjściu.</li><li><strong>Czytnik ePub:</strong> Narzędzie do dodawania książek; samo w sobie nie przechowuje danych.</li><li><strong>Strony E-ink:</strong> Wyselekcjonowana lista linków.</li><li><strong>Timer Pomodoro:</strong> Ustawienia tymczasowe.</li><li><strong>Kalkulator i Konwerter:</strong> Żadne dane nie są zapisywane.</li><li><strong>Oddychanie:</strong> Ustawienia tymczasowe.</li><li><strong>Gry Jednoosobowe:</strong> 2048, Wordle, Puzzle, Pasjans, Wykreślanka, Doom itp.</li><li><strong>Gry Podaj i Graj:</strong> Stan gry dla Statków, Szachów, Warcabów, Połącz 4 itp. nie jest synchronizowany z chmurą.</li><li><strong>Freewrite:</strong> Kody połączenia są tymczasowe.</li></ul>",
    "privacy.section.6.title": "6. Usługi Stron Trzecich",
    "privacy.section.6.body": "<p>ReKindle łączy się z następującymi publicznymi API stron trzecich, aby zapewnić funkcjonalność:</p><ul><li><strong>Google Gemini i OpenAI:</strong> Używane do inteligencji Asystenta AI (Chat).</li><li><strong>Cloudflare Workers:</strong> Używane do pośredniczenia w żądaniach AI i rozpoznawaniu pisma ręcznego.</li><li><strong>Gutendex:</strong> Używany przez Czytnik do wyszukiwania i pobierania książek z domeny publicznej.</li><li><strong>Standard Ebooks:</strong> Używany do pobierania kanałów RSS z nowymi wydaniami.</li><li><strong>Open Library:</strong> Używany do wyszukiwania książek i okładek.</li><li><strong>DictionaryAPI:</strong> Używany przez Słownik do definicji.</li><li><strong>Open-Meteo:</strong> Używany do danych pogodowych.</li><li><strong>Yahoo Finance:</strong> Używany do pobierania notowań giełdowych.</li><li><strong>OpenStreetMap:</strong> Używany przez aplikację Mapy do kafelków i tras.</li><li><strong>Reddit:</strong> Używany do pobierania publicznych postów i komentarzy.</li><li><strong>Wikipedia:</strong> Używana do pobierania codziennych wydarzeń historycznych i artykułów.</li><li><strong>GitHub:</strong> Używany jako źródło danych dla Krzyżówek i Literaków.</li><li><strong>rss2json:</strong> Używany przez aplikacje Gazeta i Czytnik RSS.</li><li><strong>Open Trivia Database:</strong> Używany przez aplikację Trivia do pytań.</li><li><strong>Stripe:</strong> Używany do bezpiecznego przetwarzania płatności za ReKindle+.</li></ul>",
    "privacy.section.7.title": "7. Kontakt",
    "privacy.section.7.body": "<p>Jeśli masz pytania dotyczące tej polityki,</p><p>Kontakt: <strong>contact@ukiyomusic.com</strong></p>"
}