{
    "privacy.title": "Informativa sulla Privacy",
    "privacy.header": "Informativa sulla Privacy per ReKindle",
    "privacy.last_updated": "Ultimo Aggiornamento: 3 Febbraio 2026",
    "privacy.intro": "ReKindle è un'applicazione web progettata per fornire una dashboard per dispositivi E-ink. Diamo priorità alla tua privacy e alla trasparenza.",
    "privacy.section.1.title": "1. Architettura dei Dati",
    "privacy.section.1.body": "<p>ReKindle opera in due modalità:</p><ul><li><strong>Modalità Ospite:</strong> Tutti i dati sono memorizzati localmente nel Local Storage del tuo browser. Niente viene inviato ai nostri server. Se cancelli la cache del browser, questi dati andranno persi.</li><li><strong>Modalità Accesso Effettuato:</strong> I dati per le app supportate vengono sincronizzati in modo sicuro su Google Firebase (Firestore & Realtime Database) sotto il tuo ID Utente univoco. Questo ti consente di accedere ai tuoi dati su più dispositivi.</li></ul>",
    "privacy.section.2.title": "2. Dati Utente Google (Gmail, Tasks, Calendar, Contatti)",
    "privacy.section.2.body": "<p>ReKindle offre l'integrazione con i servizi Google per visualizzare i tuoi dati personali sul dispositivo. Questa funzionalità è facoltativa.</p><ul><li><strong>Gmail (Ambito Limitato):</strong> Se abilitato, ReKindle accede ai tuoi messaggi Gmail per consentirti di leggere, comporre, archiviare, eliminare e inviare email direttamente dalla dashboard. Utilizza ambiti (scope) ristretti per fornire la piena funzionalità di gestione della posta.</li><li><strong>Accesso:</strong> L'app richiede l'accesso ai tuoi dati Google solo dopo che hai cliccato esplicitamente su \"Accedi\" (nell'app specifica o nelle impostazioni) e concesso l'autorizzazione tramite il protocollo sicuro OAuth 2.0 di Google.</li><li><strong>Utilizzo:</strong> Questi dati vengono recuperati direttamente dai server di Google al browser del tuo dispositivo. Vengono utilizzati esclusivamente per la visualizzazione e la modifica all'interno della dashboard di ReKindle.</li><li><strong>Archiviazione:</strong> Le tue Email, Attività, Eventi del Calendario e Contatti Google <strong>non</strong> sono memorizzati sui nostri server Firebase. Token di accesso temporanei vengono memorizzati nel Local Storage del tuo browser per mantenere la sessione attiva.</li><li><strong>Conservazione & Cancellazione:</strong> Aderiamo a una rigorosa politica di minimizzazione dei dati. Poiché i Dati Utente Google non sono memorizzati sui nostri server persistenti, non esiste una conservazione a lungo termine. I dati vengono memorizzati nella cache locale del browser per la durata della sessione e vengono <strong>eliminati immediatamente</strong> al momento del logout o della pulizia della cache del browser. Puoi revocare l'accesso di ReKindle in qualsiasi momento tramite le impostazioni di sicurezza del tuo Account Google, il che cesserà immediatamente la nostra capacità di visualizzare questi dati.</li><li><strong>Condivisione:</strong> Non condividiamo i tuoi dati utente Google con terze parti.</li></ul><p><em>L'uso da parte di ReKindle e il trasferimento a qualsiasi altra app delle informazioni ricevute dalle API di Google aderiranno alla <a href=\"https://developers.google.com/terms/api-services-user-data-policy\" target=\"_blank\" style=\"color:black;\">Google API Services User Data Policy</a>, inclusi i requisiti di utilizzo limitato (Limited Use).</em></p>",
    "privacy.section.3.title": "3. Meccanismi di Protezione Dati",
    "privacy.section.3.body": "<p>Impieghiamo misure di sicurezza standard del settore per garantire la riservatezza e l'integrità dei tuoi dati sensibili.</p><ul><li><strong>Crittografia in Transito:</strong> Tutti i dati trasmessi tra il tuo dispositivo, i nostri server e servizi di terze parti (incluse le API di Google) sono crittografati utilizzando <strong>Transport Layer Security (TLS/SSL)</strong>.</li><li><strong>Crittografia a Riposo:</strong> Qualsiasi dato sincronizzato con il nostro database (come dettagliato nella Sezione 4) è ospitato su Google Firebase (Firestore & Realtime Database), che crittografa i dati a riposo utilizzando <strong>256-bit Advanced Encryption Standard (AES-256)</strong>.</li><li><strong>Accesso Sicuro:</strong> L'accesso ai dati personali è limitato all'utente autenticato. Utilizziamo token sicuri (OAuth 2.0) per gestire l'autorizzazione senza memorizzare la tua password Google effettiva.</li></ul>",
    "privacy.section.4.title": "4. Dati Sincronizzazione Cloud Firebase",
    "privacy.section.4.body": "<p>Se crei un account ReKindle, i seguenti dati dell'app vengono memorizzati nel nostro database (Google Firebase) per abilitare le funzionalità di sincronizzazione tra i tuoi dispositivi:</p><ul><li><strong>Tasks & Quick ToDo:</strong> Elementi da fare creati nell'app principale Tasks o generati tramite scrittura a mano in Quick ToDo.</li><li><strong>Calendario (Nativo):</strong> Eventi aggiunti al calendario nativo se Google Calendar non è abilitato.</li><li><strong>Contatti (Nativo):</strong> Contatti aggiunti manualmente alla rubrica nativa se Google Contatti non è abilitato.</li><li><strong>Note:</strong> Il contenuto testuale e i timestamp delle tue note.</li><li><strong>Lettore:</strong> L'indice della tua libreria e il progresso di lettura (posizione CFI) per i tuoi libri. I file dei libri effettivi sono memorizzati localmente nella cache del browser (IndexedDB) per risparmiare larghezza di banda, ma i metadati sono sincronizzati.</li><li><strong>Impostazioni:</strong> Preferenze generali, selezione dello sfondo, interruttori di integrazione e le tue chiavi API AI personalizzate o token di terze parti (memorizzati in una collezione privata `pro_data` per gli utenti Pro).</li><li><strong>Orologio:</strong> Le tue città salvate e la posizione casa per l'Orologio Mondiale.</li><li><strong>Cruciverba & Mini Cruciverba:</strong> Stato attuale del puzzle e progresso della griglia.</li><li><strong>Sudoku:</strong> Stato attuale del puzzle e segni a matita.</li><li><strong>Nonogrammi (Picross):</strong> Progresso del puzzle e stati risolti.</li><li><strong>Prato Fiorito:</strong> Stato attuale del gioco e timer.</li><li><strong>Nerdle:</strong> Stato del gioco giornaliero e tentativi.</li><li><strong>Scacchi & Dama:</strong> Statistiche Vittorie/Sconfitte/Pareggi.</li><li><strong>Classifiche:</strong> I punteggi più alti per <strong>Blocchi (Tetris)</strong>, <strong>Snake</strong>, <strong>Trivia</strong>, <strong>Torre di Hanoi</strong>, <strong>Lights Out</strong>, <strong>Mario</strong>, <strong>Dino</strong>, <strong>Animale</strong>, e <strong>Block Blast</strong> sono memorizzati pubblicamente collegati al tuo nome utente.</li><li><strong>Lettore Interattivo:</strong> La tua libreria di avventure testuali salvate e progresso di lettura.</li><li><strong>Accordi:</strong> Le tue canzoni salvate e fogli di accordi.</li><li><strong>Trivia:</strong> La tua cronologia di gioco personale e statistiche.</li><li><strong>Diario di Lettura:</strong> Tracciamento della durata di lettura giornaliera.</li><li><strong>Tracker Abitudini:</strong> Le tue abitudini e cronologia completamento.</li><li><strong>Azioni:</strong> La lista dei simboli azionari che stai monitorando.</li><li><strong>Ricettario:</strong> Ricette che salvi.</li><li><strong>Lettore RSS:</strong> Gli URL dei feed a cui sei iscritto.</li><li><strong>Reddit:</strong> La tua lista di subreddit salvati.</li><li><strong>Flashcard:</strong> I tuoi mazzi, carte e intervalli di studio.</li><li><strong>Conto alla Rovescia:</strong> I tuoi timer eventi salvati.</li><li><strong>Spellbound (Spelling Bee):</strong> Le tue parole trovate giornaliere.</li><li><strong>Parole (Scrabble):</strong> Stato del gioco multiplayer e cronologia turni.</li><li><strong>KindleChat:</strong> I messaggi inviati nelle chat room sono memorizzati nel <strong>Realtime Database</strong> per facilitare la comunicazione istantanea ad alte prestazioni.</li><li><strong>Freewrite:</strong> Sessioni di scrittura attive e documenti salvati.</li><li><strong>Mappa Mentale:</strong> Mappe mentali salvate e layout.</li><li><strong>Suggerimenti:</strong> I tuoi suggerimenti inviati, problemi, voti e commenti.</li><li><strong>Da Guardare:</strong> I tuoi film e serie TV salvati.</li><li><strong>AirType:</strong> Le tue note salvate e sessioni di scrittura.</li><li><strong>Pixel Art:</strong> I tuoi disegni salvati, dati della tela e libreria manifest.</li><li><strong>Spartiti:</strong> La tua libreria personale di partiture. (Nota: Le partiture che carichi esplicitamente sul 'Negozio Online' sono pubbliche).</li><li><strong>Flipbook:</strong> Le tue animazioni e manifest di disegno sono sincronizzati per abilitare la modifica tra dispositivi.</li><li><strong>Risultati:</strong> Le tue squadre e leghe preferite salvate per l'app Sport.</li></ul>",
    "privacy.section.5.title": "5. Dati Solo Locali",
    "privacy.section.5.body": "<p>Le seguenti app memorizzano dati <strong>solo</strong> sul tuo dispositivo specifico tramite <code>localStorage</code> del browser (o sono puramente effimere), indipendentemente dallo stato di accesso:</p><ul><li><strong>Browser:</strong> La tua cronologia di navigazione.</li><li><strong>Lingua:</strong> Le tue unità completate, progresso lezione e statistiche vocabolario.</li><li><strong>Decidi:</strong> Le tue opzioni di decisione salvate e liste.</li><li><strong>Blocco Schizzi (Napkin):</strong> I disegni non sono salvati su alcuna memoria persistente e vengono cancellati all'uscita o aggiornamento.</li><li><strong>Lettore ePub:</strong> L'app ePub è uno strumento per aggiungere libri alla tua libreria principale Lettore. Non memorizza dati di per sé.</li><li><strong>Siti E-ink:</strong> Questa app è una lista curata di link e non memorizza alcun dato utente.</li><li><strong>Timer Pomodoro:</strong> Le impostazioni della sessione sono effimere e non salvate.</li><li><strong>Calcolatrice & Convertitore:</strong> Nessun dato viene memorizzato.</li><li><strong>Respirazione:</strong> Le impostazioni della sessione sono effimere.</li><li><strong>Giochi Giocatore Singolo:</strong> 2048 (Punteggio Alto & Stato Gioco), Wordle (Progresso Giornaliero), Puzzle, Memory, Solitario, Connessioni (Bindings), Cerca Parole, Anagrammi, Impiccato, Blackjack, Palla 8, Codebreaker, e Doom.</li><li><strong>Giochi Pass-and-Play:</strong> Lo stato del gioco per Battaglia Navale 2 Giocatori, Scacchi, Dama, Forza 4, Tris, e Texas Hold'em non è sincronizzato sul cloud.</li><li><strong>Freewrite:</strong> I codici di connessione Host/Client sono effimeri e non memorizzati permanentemente.</li></ul>",
    "privacy.section.6.title": "6. Servizi di Terze Parti",
    "privacy.section.6.body": "<p>ReKindle si connette alle seguenti API pubbliche di terze parti per fornire funzionalità:</p><ul><li><strong>Google Gemini & OpenAI:</strong> Utilizzati per l'intelligenza dell'Assistente AI (Chat). I tuoi prompt vengono inviati a questi servizi tramite il nostro proxy sicuro.</li><li><strong>Cloudflare Workers:</strong> Utilizzati per fare da proxy alle richieste per l'Assistente AI e il riconoscimento della scrittura a mano di Quick ToDo.</li><li><strong>Gutendex:</strong> Utilizzato dall'app Lettore per cercare e scaricare ebook di pubblico dominio.</li><li><strong>Standard Ebooks:</strong> Utilizzato dall'app Standard Ebooks per recuperare feed RSS.</li><li><strong>Open Library:</strong> Utilizzato per la ricerca libri e immagini di copertina.</li><li><strong>DictionaryAPI:</strong> Utilizzato dall'app Dizionario per le definizioni.</li><li><strong>Open-Meteo:</strong> Utilizzato per i dati meteo.</li><li><strong>Yahoo Finance:</strong> Utilizzato per recuperare quotazioni azionarie.</li><li><strong>OpenStreetMap:</strong> Utilizzato dall'app Mappe per le tile e il routing.</li><li><strong>Reddit:</strong> Utilizzato per recuperare post pubblici e commenti.</li><li><strong>Wikipedia:</strong> Utilizzato per recuperare eventi storici giornalieri e articoli enciclopedici.</li><li><strong>GitHub:</strong> Utilizzato come fonte dati per Cruciverba e Spellbound.</li><li><strong>rss2json:</strong> Utilizzato dalle app Giornale e Lettore RSS.</li><li><strong>Open Trivia Database:</strong> Utilizzato dall'app Trivia per le domande.</li><li><strong>Stripe:</strong> Utilizzato per elaborare in modo sicuro i pagamenti per ReKindle+.</li></ul>",
    "privacy.section.7.title": "7. Contatti",
    "privacy.section.7.body": "<p>Se hai domande su questa informativa,</p><p>Contatto: <strong>contact@ukiyomusic.com</strong></p>"
}